testFiles/cases/ViscousTubeBundle/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                  https://gitlab.com/opensimproject/CfdOF                    |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    inlet
    {
        type        patch;
    }

    outlet
    {
        type        patch;
    }

    wall
    {
        type        wall;
    }

    defaultFaces
    {
        type        wall;
    }

    MeshRefinement001
    {
        type        empty;
    }

    MeshRefinement001BackFace
    {
        type        empty;
    }

)

// ************************************************************************* //
